### Term Project
### DSC 540
### Abed Tabbalat

In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from bs4 import BeautifulSoup
import codecs
import requests

This project is about Covid-19 data, will reformat data into the best shape possible from three sources and combine the necassary variables to give an output to inform viewers on highly important results regarding the pandemic.

In [37]:
# Settings
#Pandas number format settings to be set at 0 decimat places
# Step 5 adjusting pandas settings for formatting figures
pd.options.display.float_format = '{:,.0f}'.format

# Milestone 2

In [24]:
# In this milestone, we will perform data wrangling techniques on the flat file that contains
# data on daily vaccinations by country
# The unique key identifier in all sources will be country
# Step 1 to import the flat file using Pandas
df_flat_raw = pd.read_csv('country_vaccinations.csv')
df_flat_raw.head()

,country,iso_code,date,total_vaccinations,people_vaccinated,people_fully_vaccinated,daily_vaccinations_raw,daily_vaccinations,total_vaccinations_per_hundred,people_vaccinated_per_hundred,people_fully_vaccinated_per_hundred,daily_vaccinations_per_million,vaccines,source_name,source_website
0,Afghanistan,AFG,2021-02-22,0,0,NaN,NaN,NaN,0,0,NaN,NaN,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
1,Afghanistan,AFG,2021-02-23,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
2,Afghanistan,AFG,2021-02-24,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
3,Afghanistan,AFG,2021-02-25,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
4,Afghanistan,AFG,2021-02-26,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/

In [25]:
# Before doing any altering exercise, I will create a new variable name to keep the raw data stored as it is
# Will need to change the column names, in order to do that we need to see what the column names are
# Will use the list() function to call a list of the column names
df_flat = df_flat_raw
list(df_flat.columns)

['country',
 'iso_code',
 'date',
 'total_vaccinations',
 'people_vaccinated',
 'people_fully_vaccinated',
 'daily_vaccinations_raw',
 'daily_vaccinations',
 'total_vaccinations_per_hundred',
 'people_vaccinated_per_hundred',
 'people_fully_vaccinated_per_hundred',
 'daily_vaccinations_per_million',
 'vaccines',
 'source_name',
 'source_website']

In [26]:
# Step 2: Updating column headers using the column attribute:
df_flat.columns = ['Country', 'ISO Code', 'Date','Total Vaccinations', 
                    'People Vaccinated', 'People Fully Vaccinated', 'Daily Vaccinations Raw',
                    'Daily Vaccinations', 'Total Vaccinations/100', 'People Vaccinated/100', 
                    'People Fully Vaccinated/100', 'Daily Vaccinations/Mil', 'Vaccines',
                    'Source Name Vaccinations', 'Source Website Vaccinations']
df_flat.head()

,Country,ISO Code,Date,Total Vaccinations,People Vaccinated,People Fully Vaccinated,Daily Vaccinations Raw,Daily Vaccinations,Total Vaccinations/100,People Vaccinated/100,People Fully Vaccinated/100,Daily Vaccinations/Mil,Vaccines,Source Name Vaccinations,Source Website Vaccinations
0,Afghanistan,AFG,2021-02-22,0,0,NaN,NaN,NaN,0,0,NaN,NaN,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
1,Afghanistan,AFG,2021-02-23,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
2,Afghanistan,AFG,2021-02-24,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
3,Afghanistan,AFG,2021-02-25,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/
4,Afghanistan,AFG,2021-02-26,NaN,NaN,NaN,NaN,"1,367",NaN,NaN,NaN,34,"Johnson&Johnson, Oxford/AstraZeneca, Pfizer/Bi...",World Health Organization,https://covid19.who.int/

In [27]:
# Step 3: is to remove columns that wont be needed for the project
# The columns that will remain are shown below
df_flat_1 = df_flat[['Country', 'Total Vaccinations', 'People Vaccinated']]
df_flat_1

           Country  Total Vaccinations  People Vaccinated
0      Afghanistan                   0                  0
1      Afghanistan                 NaN                NaN
2      Afghanistan                 NaN                NaN
3      Afghanistan                 NaN                NaN
4      Afghanistan                 NaN                NaN
...            ...                 ...                ...
71810     Zimbabwe           7,432,819          4,204,134
71811     Zimbabwe           7,438,485          4,206,370
71812     Zimbabwe           7,446,076          4,210,000
71813     Zimbabwe           7,458,519          4,216,112
71814     Zimbabwe           7,472,553          4,223,110

[71815 rows x 3 columns]

In [28]:
# Step 4: will summarize the data to have 1 country as a unique ID by using groupby() function
# Using mean since some countries have missing reported dates of vaccinations
df_flat_1 = df_flat_1.groupby('Country').mean().reset_index()
df_flat_1

               Country  Total Vaccinations  People Vaccinated
0          Afghanistan           1,588,162          1,335,322
1              Albania           1,095,255            727,809
2              Algeria           9,435,633          5,414,206
3              Andorra              44,010             29,327
4               Angola           4,244,810          2,800,567
..                 ...                 ...                ...
218              Wales           3,626,606          1,931,716
219  Wallis and Futuna               8,834              4,836
220              Yemen             318,941            265,881
221             Zambia             638,290            187,488
222           Zimbabwe           3,348,647          1,966,053

[223 rows x 3 columns]

In [29]:
# Step 5 is to check for duplicates
print(f'Any duplicated country: {any(df_flat_1.duplicated())}')
# Result confirms no duplicates

Any duplicated country: False

In [30]:
# Step 6 is to check for NULLS in the dataframe
print(f'Any NULLS in Total Vaccinations: {df_flat_1["Total Vaccinations"].isnull().values.any()}')
print(f'Any NULLS in People Vaccinated: {df_flat_1["People Vaccinated"].isnull().values.any()}')
# Result makes sense because using the groupby() function and applying mean() should eliminate the NULLS

Any NULLS in Total Vaccinations: False
Any NULLS in People Vaccinated: False

In [31]:
# Step 7: Data shape is ready for phase 2.
df_flat_1

               Country  Total Vaccinations  People Vaccinated
0          Afghanistan           1,588,162          1,335,322
1              Albania           1,095,255            727,809
2              Algeria           9,435,633          5,414,206
3              Andorra              44,010             29,327
4               Angola           4,244,810          2,800,567
..                 ...                 ...                ...
218              Wales           3,626,606          1,931,716
219  Wallis and Futuna               8,834              4,836
220              Yemen             318,941            265,881
221             Zambia             638,290            187,488
222           Zimbabwe           3,348,647          1,966,053

[223 rows x 3 columns]

# Milestone 3

In [32]:
# using pandas to read html. had issues with forbidden HTTP and therefore I used the help of a post in
# stackoverflow to import the requests package and place the header to call the HTML site
url = 'https://www.worldometers.info/world-population/population-by-country/'
header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
  "X-Requested-With": "XMLHttpRequest"
}

In [33]:
# Used the requests.get function to call the website (similar to APIs) and the table is now readable.
r = requests.get(url, headers=header)
dfs_web = pd.read_html(r.text)

In [34]:
# Checking how many dataframes the website contains. Looking at the web page there is only one table
len(dfs_web)

1

In [40]:
# defining the table to begin data wrangling process.
df_web_raw = dfs_web[0]
df_web_raw

,#,Country (or dependency),Population (2020),Yearly Change,Net Change,Density (P/Km²),Land Area (Km²),Migrants (net),Fert. Rate,Med. Age,Urban Pop %,World Share
0,1,China,1439323776,0.39 %,5540090,153,9388211,"-348,399",1.7,38,61 %,18.47 %
1,2,India,1380004385,0.99 %,13586631,464,2973190,"-532,687",2.2,28,35 %,17.70 %
2,3,United States,331002651,0.59 %,1937734,36,9147420,"954,806",1.8,38,83 %,4.25 %
3,4,Indonesia,273523615,1.07 %,2898047,151,1811570,"-98,955",2.3,30,56 %,3.51 %
4,5,Pakistan,220892340,2.00 %,4327022,287,770880,"-233,379",3.6,23,35 %,2.83 %
...,...,...,...,...,...,...,...,...,...,...,...,...
230,231,Montserrat,4992,0.06 %,3,50,100,NaN,N.A.,N.A.,10 %,0.00 %
231,232,Falkland Islands,3480,3.05 %,103,0,12170,NaN,N.A.,N.A.,66 %,0.00 %
232,233,Niue,1626,0.68 %,11,6,260,NaN,N.A.,N.A.,46 %,0.00 %
233,234,Tokelau,1357,1.27 %,17,136,10,NaN,N.A.,N.A.,0 %,0.00 %
234,235,Holy See,801,0.25 %,2,2003,0,NaN,N.A.,N.A.,N.A.,0.00 %

In [43]:
# Step 1: Updating column headers using the column attribute:
# Will call a list to see the full column names
df_web = df_web_raw
list(df_web.columns)

['#',
 'Country (or dependency)',
 'Population (2020)',
 'Yearly Change',
 'Net Change',
 'Density (P/Km²)',
 'Land Area (Km²)',
 'Migrants (net)',
 'Fert. Rate',
 'Med. Age',
 'Urban Pop %',
 'World Share']

In [44]:
# Renaming columns for more clarity.
df_web.columns = ['#', 'Country', 'Population', 'Yearly Change', 'Net Change', 'Density', 'Land Area', 
                  'Migrants', 'Fertility Rate', 'Median Age', 'Urban Population Percentage', 'World Share']
df_web

,#,Country,Population,Yearly Change,Net Change,Density,Land Area,Migrants,Fertility Rate,Median Age,Urban Population Percentage,World Share
0,1,China,1439323776,0.39 %,5540090,153,9388211,"-348,399",1.7,38,61 %,18.47 %
1,2,India,1380004385,0.99 %,13586631,464,2973190,"-532,687",2.2,28,35 %,17.70 %
2,3,United States,331002651,0.59 %,1937734,36,9147420,"954,806",1.8,38,83 %,4.25 %
3,4,Indonesia,273523615,1.07 %,2898047,151,1811570,"-98,955",2.3,30,56 %,3.51 %
4,5,Pakistan,220892340,2.00 %,4327022,287,770880,"-233,379",3.6,23,35 %,2.83 %
...,...,...,...,...,...,...,...,...,...,...,...,...
230,231,Montserrat,4992,0.06 %,3,50,100,NaN,N.A.,N.A.,10 %,0.00 %
231,232,Falkland Islands,3480,3.05 %,103,0,12170,NaN,N.A.,N.A.,66 %,0.00 %
232,233,Niue,1626,0.68 %,11,6,260,NaN,N.A.,N.A.,46 %,0.00 %
233,234,Tokelau,1357,1.27 %,17,136,10,NaN,N.A.,N.A.,0 %,0.00 %
234,235,Holy See,801,0.25 %,2,2003,0,NaN,N.A.,N.A.,N.A.,0.00 %

In [45]:
# Step 2 will need from this dataset the Country column and the Population column as the rest of the data
# is irrelevant to this project
df_web_1 = df_web[['Country', 'Population']]
df_web_1

              Country  Population
0               China  1439323776
1               India  1380004385
2       United States   331002651
3           Indonesia   273523615
4            Pakistan   220892340
..                ...         ...
230        Montserrat        4992
231  Falkland Islands        3480
232              Niue        1626
233           Tokelau        1357
234          Holy See         801

[235 rows x 2 columns]

In [46]:
# Step 3 is to make sure there are no NA's or N.A (this was visible in the original dataframe).
# first replacing N.A. (if any) to None to give NaNs that Pandas identify.
df_web_1.replace('N.A.', None)

              Country  Population
0               China  1439323776
1               India  1380004385
2       United States   331002651
3           Indonesia   273523615
4            Pakistan   220892340
..                ...         ...
230        Montserrat        4992
231  Falkland Islands        3480
232              Niue        1626
233           Tokelau        1357
234          Holy See         801

[235 rows x 2 columns]

In [47]:
# Checking for NaNs and Duplicates
print(f'Any duplicated country: {any(df_web_1.duplicated())}')
print(f'Any NULLS in Population: {df_web_1["Population"].isnull().values.any()}')
# Result shows no duplicates nor NaNs

Any duplicated country: False
Any NULLS in Population: False

In [48]:
# Step 4 updating the Population column format
# Population column not being formatted and this is because is set as int and will convert to float
# first step is to use dtypes on the dataframe to determine which columns needs to be changed
df_web_1.dtypes

Country       object
Population     int64
dtype: object

In [51]:
# Will change the Population column type to float by using astype() function
df_web_1 = df_web_1.astype({'Population' : 'float64'})

In [52]:
# Data is in shape and ready for Phase 2
df_web_1

              Country    Population
0               China 1,439,323,776
1               India 1,380,004,385
2       United States   331,002,651
3           Indonesia   273,523,615
4            Pakistan   220,892,340
..                ...           ...
230        Montserrat         4,992
231  Falkland Islands         3,480
232              Niue         1,626
233           Tokelau         1,357
234          Holy See           801

[235 rows x 2 columns]